# This file is generated by Anlogic Timing Wizard. 29 09 2020

#Created Clock
create_clock -name i_clk_24Mhz -period 42 -waveform {0 21} [get_ports {i_clk_24Mhz}]
create_clock -name i_mck -period 80 -waveform {0 40} [get_ports {i_mck}]

#Set Clock Uncertainty
set_clock_uncertainty 0.2  [get_clocks {i_clk_24Mhz}]
set_clock_uncertainty 0.2  [get_clocks {i_mck}]

#Set False Path
set_false_path  -from [get_clocks {i_clk_24Mhz}] -to [get_clocks {i_mck}]

